In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
dict1={'names':["shashank",np.nan,"rahuk"],
        'age':[np.nan,21,34],
        'city':["hyd",'bang',np.nan]
}

In [5]:
dict1

{'names': ['shashank', nan, 'rahuk'],
 'age': [nan, 21, 34],
 'city': ['hyd', 'bang', nan]}

In [7]:
pd.DataFrame(dict1,index=["p1","p2","p3"])

       names   age  city
p1  shashank   NaN   hyd
p2       NaN  21.0  bang
p3     rahuk  34.0   NaN

In [9]:
d1=pd.DataFrame(dict1)

In [10]:
d1.dtypes

names     object
age      float64
city      object
dtype: object

In [11]:
d1.isnull()

   names    age   city
0  False   True  False
1   True  False  False
2  False  False   True

In [12]:
d1.isnull().sum()

names    1
age      1
city     1
dtype: int64

In [13]:
# np.nan =means it is not a number applicable for numerical columns

In [14]:
# percentage of null values in each column
d1.isnull().sum()*100/len(d1)

names    33.333333
age      33.333333
city     33.333333
dtype: float64

**Method-1**

**Fill with some random value**

**Method name**: fill na

In [15]:
d1.fillna(40)

      names   age  city
0  shashank  40.0   hyd
1        40  21.0  bang
2     rahuk  34.0    40

**Method-2**

- We can fill the values w.r.t columns also

In [17]:
d1['names'].fillna("ravi",inplace=True)

In [18]:
d1

      names   age  city
0  shashank   NaN   hyd
1      ravi  21.0  bang
2     rahuk  34.0   NaN

**Method-3**

- bfill

- ffill

- pad

- backfill

In [19]:
dict1={'names':["shashank",np.nan,"rahuk"],
        'age':[np.nan,21,34],
        'city':["hyd",'bang',np.nan]
}

In [20]:
dict1

{'names': ['shashank', nan, 'rahuk'],
 'age': [nan, 21, 34],
 'city': ['hyd', 'bang', nan]}

In [21]:
d1=pd.DataFrame(dict1)

In [22]:
d1

      names   age  city
0  shashank   NaN   hyd
1       NaN  21.0  bang
2     rahuk  34.0   NaN

In [23]:
d1.fillna(method="bfill")

/var/folders/24/8tn3hq_n69b3bh_npr321plm0000gn/T/ipykernel_56552/2947328357.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill")

      names   age  city
0  shashank  21.0   hyd
1     rahuk  21.0  bang
2     rahuk  34.0   NaN

In [24]:
d1.fillna(method='bfill',axis=1)

/var/folders/24/8tn3hq_n69b3bh_npr321plm0000gn/T/ipykernel_56552/981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

      names   age  city
0  shashank   hyd   hyd
1      21.0  21.0  bang
2     rahuk  34.0   NaN

In [25]:
 d1.fillna(method='backfill')

/var/folders/24/8tn3hq_n69b3bh_npr321plm0000gn/T/ipykernel_56552/3543224983.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

      names   age  city
0  shashank  21.0   hyd
1     rahuk  21.0  bang
2     rahuk  34.0   NaN

# pad and ffill are same

In [26]:
d1.fillna(method='pad')

/var/folders/24/8tn3hq_n69b3bh_npr321plm0000gn/T/ipykernel_56552/3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

      names   age  city
0  shashank   NaN   hyd
1  shashank  21.0  bang
2     rahuk  34.0  bang

In [27]:
d1.fillna(method='ffill')

/var/folders/24/8tn3hq_n69b3bh_npr321plm0000gn/T/ipykernel_56552/4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

      names   age  city
0  shashank   NaN   hyd
1  shashank  21.0  bang
2     rahuk  34.0  bang

**Method-4**

- mean

    - Numerical values can fill with mean value

    - but mean affect by outliers

    - if we dont have outliers it is best one

- medain 

    - Numerical values can fill with median value

    - we know that median value does not affect with outliers

    - so if outliers are there we can go with median

- mode

    - Mode is useful for categorical data

In [29]:
dict1={'names':["shashank",np.nan,"rahuk"],
        'age':[np.nan,21,34],
        'city':["hyd",'bang',np.nan]
}
d1=pd.DataFrame(dict1)

In [30]:
agemean=d1['age'].mean()

In [33]:
d1['age'].fillna(agemean,inplace=True)

In [34]:
d1

      names   age  city
0  shashank  27.5   hyd
1       NaN  21.0  bang
2     rahuk  34.0   NaN

**Method-5**

**KNN imputer**

- KNN: K neartest Neighbours

- K is a hyper paramter means user can choose

- It is distance metric: **Euclidian distance**

- KNN imputer will take the mean of the neigbours value

- The neibhours value can provided by using  value =k

- It is under sklearn package

- Under sklearn we have Imputer method

- Under imputer method we have KnnImputer

- Applicable only for Numerical data

In [36]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['age']])

array([[27.5],
       [21. ],
       [34. ]])